IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod
Verification of concrete under compression or shear

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.notSet
the method has not been set

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.Method_6_8_7_1
method 6.8.7 (1) according to EN 1992-1-1

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.Method_6_8_7_2
method 6.8.7 (2) according to EN 1992-1-1

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.Method_6_8_7_101
method 6.8.7 (101) according to EN 1992-2

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.Method_6_8_7_101_ANNEX_NEN
method 6.8.7 (101) according to EN 1992-2

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.Method_Shear_6_8_7_4
6.8.7 Verification of concrete under compression or shear

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.Method_Reinf_6_8_5_3
6.8.5 Verification using damage equivalent stress range - reinfrocement

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.Method_Prestress_6_8_5_3
6.8.5 Verification using damage equivalent stress range - prestress

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.Method_NN112
EN 1992-2, annex NN eq. NN.112

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.Method_Reinf_NN102
reinforcement EN 1992-2, annex NN eq. NN.102

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.Method_Reinf_NN107
reinforcement EN 1992-2, annex NN eq. NN.107

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.Method_Tendon_NN102
tendon EN 1992-2, annex NN eq. NN.102

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.Method_Tendon_NN107
tendon EN 1992-2, annex NN eq. NN.107

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.Method_6_8_7_2_Shear
method 6.8.7 (2) according to EN 1992-1-1 under shear

IdeaRS.OpenModel.Concrete.CheckResult.FatigueMethod.Method_Reinf_6_8_5_3_Shear
6.8.5 Verification of concrete under compression or shear